zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/system_stm32mp2xx_a35_utils.c
/*******************************************************************************
 * @file    system_stm32mp2xx_a35_utils.c
 * @author  C.ICORD (Intropack Team)
 * @version $VERSION$
 * @date    $DATE$
 *
 * @brief   A35 cores management functions (Aarch32 & Aarch64 modes)
 *
 * Reference documents :
 *
 * . [A35_TRM]
 *   "Arm Cortex-A35 Processor"
 *   "Technical Reference Manual / 100236_0100_00_en"
 *   Revision: r1p0 / Issue 0100-00 / 28-Feb-2019
 *   (file cortex_a35_trm_100236_0100_00_en.pdf)
 *
 * . [ARM_DDI_0487B.a] ARM Architecture Reference Manual
 *   "ARMv8, for ARMv8-A architecture profile"
 *   ARM DDI 0487B.a -- 31-March-2017
 *   (file DDI0487B_a_armv8_arm.pdf)
 *
 *******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2022 STMicroelectronics</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 *******************************************************************************
 */
/* Debug specific */
//#define DEBUG
//#define DEBUG_PMU
//#define DEBUG_FREQ

#include <string.h>
#include <stdio.h>

#include <stm32mp2xx.h>
#include "core_ca.h"
#include "system_stm32mp2xx_a35_utils.h"

/* Global variables ----------------------------------------------------------*/
static uint32_t gl_cpu_freq_in_Hz = 0;

////////////////////////////////////////////////////////////////////////////////
/* Aarch32 & Aarch64 handling functions : */
/* - processor identification */
////////////////////////////////////////////////////////////////////////////////
uint32_t a35_get_core_id( void )
{
   uint32_t val_reg;

#ifdef __AARCH64__
   /* Get value of Multiprocessor Affinity Register (EL1)         */
   /* (see #D7.2.74 in [ARM DDI 0487B.a] and #B2.84 in [A35_TRM]) */
   asm volatile("MRS %0, MPIDR_EL1"   :"=r" (val_reg) : /* no input regs */ : /* no clobbered regs */);
#else
   /* Get value of Multiprocessor Affinity Register                */
   /* (see #G6.2.105 in [ARM DDI 0487B.a] and #B1.97 in [A35_TRM]) */
   asm volatile("MRC p15, 0, %0, c0, c0, 5"   :"=r" (val_reg) : /* no input regs */ : /* no clobbered regs */);
#endif /* __AARCH64__ */
   val_reg = val_reg & 0xF;
   return (val_reg);
}


////////////////////////////////////////////////////////////////////////////////
/* - security management */
////////////////////////////////////////////////////////////////////////////////
#if defined(A35_NON_SECURE)
uint32_t a35ns_call_el3_monitor( uint32_t a_command, uint32_t a_param1,
                                 uint32_t a_param2, uint32_t a_param3 )
{
   uint32_t status;

#ifndef __AARCH64__
   asm volatile("MOV    r0, %0" : : "r" (a_command));
   asm volatile("MOV    r1, %0" : : "r" (a_param1));
   asm volatile("MOV    r2, %0" : : "r" (a_param2));
   asm volatile("MOV    r3, %0" : : "r" (a_param3));
#endif /* __AARCH64__ */

   /* Request to read the security flag : Secure monitor call #2 */
   asm volatile("SMC  #2");
#ifndef __AARCH64__
   asm volatile("MOV    %0, r0" : "=r" (status) : : );
#endif /* __AARCH64__ */

   return status;
}
#endif /* defined(A35_NON_SECURE) */


#if defined(GTIM_CNTFREQ_SYNC_ENABLE)
uint32_t a35_set_cntfrq( uint32_t a_command, uint32_t a_param1,
                                 uint32_t a_param2, uint32_t a_param3 )
{
   uint32_t status;

#ifndef __AARCH64__
   asm volatile("MOV    r0, %0" : : "r" (a_command));
   asm volatile("MOV    r1, %0" : : "r" (a_param1));
   asm volatile("MOV    r2, %0" : : "r" (a_param2));
   asm volatile("MOV    r3, %0" : : "r" (a_param3));
#endif /* __AARCH64__ */

   /* Secure monitor call :  To Set a PE counter Frequency at El3 Level */
   asm volatile("SMC #0");

#ifndef __AARCH64__
   asm volatile("MOV    %0, r0" : "=r" (status) : : );
#endif /* __AARCH64__ */

   return status;
}
#endif /* GTIM_CNTFREQ_SYNC_ENABLE */


////////////////////////////////////////////////////////////////////////////////
/* - cache management */
////////////////////////////////////////////////////////////////////////////////
bool_t a35_instruction_cache_is_enable( void )
{
   /* Get bit 12 "I" (Instruction cache) in control register */
   return (bool_t)((a35_get_sctlr() & (1<<12))>>12);
}

void a35_enable_data_cache( void )
{
   uint32_t reg_val = a35_get_sctlr();

   /* ensure all data accesses are completed */
   asm volatile("dsb sy");

   /* Set bit 2 "C" (Data cache) in control register */
   reg_val |= (1<<2);
   a35_set_sctlr(reg_val);

   return;
}

void a35_disable_data_cache( void )
{
   uint32_t reg_val = a35_get_sctlr();

   /* ensure all data accesses are completed */
   asm volatile("dsb sy");

   /* Clear bit 2 "C" (Data cache) in control register */
   reg_val &= ~(1<<2);
   a35_set_sctlr(reg_val);

   return;
}

bool_t a35_data_cache_is_enable( void )
{
   /* Get bit 2 "C" (Data cache) in control register */
   return (bool_t)((a35_get_sctlr() & (1<<2))>>2);
}

void a35_clean_data_cache( void )
{
#ifdef __AARCH64__
  asm volatile (
    "  dmb   sy                      \n\t" /* ensure ordering with previous memory accesses */
    "  mrs   x0, clidr_el1           \n\t" /* read clidr */
    "  and   x3, x0, #0x7000000      \n\t" /* extract loc from clidr */
    "  lsr   x3, x3, #23             \n\t" /* left align loc bit field */
    "  cbz   x3, c_finished          \n\t" /* if loc is 0, then no need to clean */
    "  mov   x10, #0                 \n\t" /* start clean at cache level 0 */
    "c_loop1:                        \n\t"
    "  add   x2, x10, x10, lsr #1    \n\t" /* work out 3x current cache level */
    "  lsr   x1, x0, x2              \n\t" /* extract cache type bits from clidr */
    "  and   x1, x1, #7              \n\t" /* mask of the bits for current cache only */
    "  cmp   x1, #2                  \n\t" /* see what cache we have at this level */
    "  b.lt  c_skip                  \n\t" /* skip if no cache, or just i-cache */
    "  msr   csselr_el1, x10         \n\t" /* select current cache level in csselr */
    "  isb                           \n\t" /* isb to sych the new cssr&csidr */
    "  mrs    x1, ccsidr_el1         \n\t" /* read the new ccsidr */
    "  and    x2, x1, #7             \n\t" /* extract the length of the cache lines */
    "  add    x2, x2, #4             \n\t" /* add 4 (line length offset) */
    "  mov    x4, #0x3ff             \n\t"
    "  and    x4, x4, x1, lsr #3     \n\t" /* find maximum number on the way size */
    "  clz    w5, w4                 \n\t" /* find bit position of way size increment */
    "  mov    x7, #0x7fff            \n\t"
    "  and    x7, x7, x1, lsr #13    \n\t" /* extract max number of the index size */
    "c_loop2:                        \n\t"
    "  mov    x9, x4                 \n\t" /* create working copy of max way size */
    "c_loop3:                        \n\t"
    "  lsl    x6, x9, x5             \n\t"
    "  orr    x11, x10, x6           \n\t" /* factor way and cache number into x11 */
    "  lsl    x6, x7, x2             \n\t"
    "  orr    x11, x11, x6           \n\t" /* factor index number into x11 */
    "  dc     csw, x11               \n\t" /* clean by set/way */
    "  subs   x9, x9, #1             \n\t" /* decrement the way */
    "  b.ge   c_loop3                \n\t"
    "  subs   x7, x7, #1             \n\t" /* decrement the index */
    "  b.ge   c_loop2                \n\t"
    "c_skip:                         \n\t"
    "  add    x10, x10, #2           \n\t" /* increment cache number */
    "  cmp    x3, x10                \n\t"
    "  b.gt   ci_loop1               \n\t"
    "c_finished:                     \n\t"
    "  mov    x10, #0                \n\t" /* switch back to cache level 0 */
    "  msr    csselr_el1, x10        \n\t" /* select current cache level in csselr */
    "  dsb    sy                     \n\t"
    "  isb                           \n\t"
  );
#else
//  L1C_CleanDCacheAll();
  asm volatile (
    "  PUSH   {r0-r11}               \n\t" /* Save Context */
    "  DMB                           \n\t" /* ensure ordering with previous memory accesses */
    "  MRC    p15, 1, r0, c0, c0, 1  \n\t" /* read clidr */
    "  ANDs   r3, r0, #0x7000000     \n\t" /* extract loc from clidr */
    "  MOV    r3, r3, lsr #23        \n\t" /* left align loc bit field */
    "  BEQ    c_finished             \n\t" /* if loc is 0, then no need to clean */
    "  MOV    r10, #0                \n\t" /* start clean at cache level 0 */
    "c_levels:                       \n\t"
    "  ADD    r2, r10, r10, lsr #1   \n\t" /* work out 3x current cache level */
    "  MOV    r1, r0, lsr r2         \n\t" /* extract cache type bits from clidr */
    "  AND    r1, r1, #7             \n\t" /* mask of the bits for current cache only */
    "  CMP    r1, #2                 \n\t" /* see what cache we have at this level */
    "  BLT    c_skip                 \n\t" /* skip if no cache, or just i-cache */
    "  MCR    p15, 2, r10, c0, c0, 0 \n\t" /* select current cache level in cssr */
    "  ISB                           \n\t" /* isb to sych the new cssr&csidr */
    "  MRC    p15, 1, r1, c0, c0, 0  \n\t" /* read the new csidr */
    "  AND    r2, r1, #7             \n\t" /* extract the length of the cache lines */
    "  ADD    r2, r2, #4             \n\t" /* add 4 (line length offset) */
    "  LDR    r4, =0x3ff             \n\t"
    "  ANDS   r4, r4, r1, lsr #3     \n\t" /* find maximum number on the way size */
    "  CLZ    r5, r4                 \n\t" /* find bit position of way size increment */
    "  LDR    r7, =0x7fff            \n\t"
    "  ANDS   r7, r7, r1, lsr #13    \n\t" /* extract max number of the index size */
    "c_loop1:                        \n\t"
    "  MOV    r9, r7                 \n\t" /* create working copy of max index */
    "c_loop2:                        \n\t"
    "  LSL    r6, r9, r5             \n\t"
    "  ORR    r11, r10, r6           \n\t" /* factor way and cache number into r11 */
    "  LSL    r6, r7, r2             \n\t"
    "  ORR    r11, r11, r6           \n\t" /* factor index number into r11 */
    "  MCR    p15, 0, r11, c7, c10,2 \n\t" /* clean by set/way */
    "  SUBS   r9, r9, #1             \n\t" /* decrement the index */
    "  BGE    c_loop2                \n\t"
    "  SUBS   r4, r4, #1             \n\t" /* decrement the way */
    "  BGE    c_loop1                \n\t"
    "c_skip:                         \n\t"
    "  ADD    r10, r10, #2           \n\t" /* increment cache number */
    "  CMP    r3, r10                \n\t"
    "  BGT    c_levels               \n\t"
    "c_finished:                     \n\t"
    "  MOV    r10, #0                \n\t" /* switch back to cache level 0 */
    "  MCR    p15, 2, r10, c0, c0, 0 \n\t" /* select current cache level in cssr */
    "  DSB    st                     \n\t"
    "  ISB                           \n\t"
    "  POP    {r0-r11}               \n\t" /* Restore Context */
  );
#endif /* __AARCH64__ */
  return;
}

bool_t a35_is_data_in_cached_sysram( void *ap_data )
{
#define ADDR_MASK32          0xF0000000UL
#define CACHED_SYSRAM_MASK32 0x30000000UL
   bool_t data_in_cached_sysram;

   if (((uint32_t)ap_data & ADDR_MASK32) == CACHED_SYSRAM_MASK32)
      data_in_cached_sysram = TRUE;
   else
      data_in_cached_sysram = FALSE;

   return data_in_cached_sysram;
}

////////////////////////////////////////////////////////////////////////////////
/* - memory unit (MMU) management */
////////////////////////////////////////////////////////////////////////////////
bool_t a35_memory_unit_is_enable()
{
   /* Get bit 0 "M" (Memory Management Unit) in control register */
   return (bool_t)(a35_get_sctlr() & (1<<0));
}

////////////////////////////////////////////////////////////////////////////////
/* - processor state management */
////////////////////////////////////////////////////////////////////////////////
#ifdef __AARCH64__
uint32_t a35_aa64_get_current_el( void )
{
   uint32_t reg_val;

