zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/system_stm32mp2xx_a35_utils.c
   /* Get Current Exception Level        */
   /* (see #C5.2.1 in [ARM DDI 0487B.a]) */
   asm volatile ("MRS    %0,CurrentEL" :"=r" (reg_val));
   /* Extract EL, bits [3:2] */
   return(reg_val>>2);
}
#else  /* __AARCH64__ */
uint32_t a35_aa32_get_current_mode( void )
{
   uint32_t reg_val;

   /* Get Current Exception Level in Aarch32     */
   /* (see #G8.2.34 in [ARM DDI 0487K_a]) */
   asm volatile("MRS %0, cpsr" : "=r" (reg_val));
   /* Extract EL, bits [3:0] */
   return(reg_val & 0xF);
}
#endif


uint32_t a35_get_sctlr( void )
{
   uint32_t reg_val;
#ifdef __AARCH64__
   /* In Aarch64, read SCTLR_ELx according to current Exception Level */
   uint32_t current_el = a35_aa64_get_current_el() & 0x3UL;
   switch (current_el)
   {
      case 3 :
         /* Get Control Register for exception level 3                  */
         /* (see #D7.2.90 in [ARM DDI 0487B.a] and #B2.92 in [A35_TRM]) */
         asm volatile ("MRS    %0,SCTLR_EL3" :"=r" (reg_val));
         break;
      case 2 :
         /* Get Control Register for exception level 2                  */
         /* (see #D7.2.89 in [ARM DDI 0487B.a] and #B2.91 in [A35_TRM]) */
         asm volatile ("MRS    %0,SCTLR_EL2" :"=r" (reg_val));
         break;
      case 1 :
         /* Get Control Register for exception level 1                  */
         /* (see #D7.2.88 in [ARM DDI 0487B.a] and #B2.90 in [A35_TRM]) */
         asm volatile ("MRS    %0,SCTLR_EL1" :"=r" (reg_val));
         break;
      case 0 :
      default :
         /* NO Control Register for exception level 0 */
         reg_val = 0xDEADBEEFUL;
         break;
   }
#else
   /* In Aarch32, get Control Register SCTLR                        */
   /* (see #G6.2.118 in [ARM DDI 0487B.a] and #B1.105 in [A35_TRM]) */
   asm volatile("MRC p15, 0, %0, c1, c0, 0" : "=r"(reg_val) : : );
#endif /* __AARCH64__ */
   return(reg_val);
}

void a35_set_sctlr( uint32_t a_sctlr_val )
{
#ifdef __AARCH64__
   /* In Aarch64, write SCTLR_ELx according to current Exception Level */
   uint32_t current_el = a35_aa64_get_current_el() & 0x3UL;
   switch (current_el)
   {
      case 3 :
         /* Set Control Register for exception level 3                  */
         /* (see #D7.2.90 in [ARM DDI 0487B.a] and #B2.92 in [A35_TRM]) */
         asm volatile ("MSR    SCTLR_EL3,%0" : : "r" (a_sctlr_val) : );
         break;
      case 2 :
         /* Set Control Register for exception level 2                  */
         /* (see #D7.2.89 in [ARM DDI 0487B.a] and #B2.91 in [A35_TRM]) */
         asm volatile ("MSR    SCTLR_EL2,%0" : : "r" (a_sctlr_val) : );
         break;
      case 1 :
         /* Set Control Register for exception level 1                  */
         /* (see #D7.2.88 in [ARM DDI 0487B.a] and #B2.90 in [A35_TRM]) */
         asm volatile ("MSR    SCTLR_EL1,%0" : : "r" (a_sctlr_val) : );
         break;
      case 0 :
      default :
         /* NO Control Register for exception level 0 : do nothing */
         break;
   }
#else
   /* In Aarch32, set Control Register SCTLR                        */
   /* (see #G6.2.118 in [ARM DDI 0487B.a] and #B1.105 in [A35_TRM]) */
   asm volatile("MCR p15, 0, %0, c1, c0, 0" : : "r"(a_sctlr_val) : );
#endif /* __AARCH64__ */
   return;
}

///////////////////////////////////////////////////////////////////////////////

#if 0
/* - timer management */
uint64_t a35_get_generic_timestamp( void )
{
   uint64_t val_reg64;

   asm volatile ("MRS    %0,CNTPCT_EL0" :"=r" (val_reg64));
   return val_reg64;
}

uint32_t a35_get_generic_timestamp_lsb( void )
{
   uint64_t val_reg64;

   asm volatile ("MRS    %0,CNTPCT_EL0" :"=r" (val_reg64));
   return (uint32_t)val_reg64;
}

uint32_t a35_get_generic_timestamp_msb( void )
{
   uint64_t val_reg64;

   asm volatile ("MRS    %0,CNTPCT_EL0" :"=r" (val_reg64));
   return (uint32_t)(val_reg64>>32);
}
#endif

/* - performance monitor unit (PMU) management */
void a35_pmu_cycle_count_start( uint32_t count_div_by_64 )
{
#ifdef __AARCH64__
   uint64_t reg64_val;
#else
   uint32_t reg32_val;
#endif /* __AARCH64__ */

   /* complete all data transactions */
   asm volatile("dsb sy");

   /* configure the 64-bit cycle counter : */
   /* - reset it by setting bit 2 "C" "clock counter reset" */
#ifdef __AARCH64__
   /* . in Aarch64, via register PMCR_EL0                          */
   /*   (see #D7.4.7 in [ARM DDI 0487B.a] and #C10.6 in [A35_TRM]) */
   asm volatile("MRS %0, PMCR_EL0" : "=r"(reg64_val) : : );
   reg64_val |= (1<<2);
   asm volatile("MSR PMCR_EL0, %0" : : "r"(reg64_val) : );
#else
   /* . in Aarch32, via register PMCR                              */
   /*   (see #G6.4.9 in [ARM DDI 0487B.a] and #C10.2 in [A35_TRM]) */
   asm volatile("MRC p15, 0, %0, c9, c12, 0" : "=r"(reg32_val) : : );
   reg32_val |= (1<<2);
   asm volatile("MCR p15, 0, %0, c9, c12, 0" : : "r"(reg32_val) : );
#endif /* __AARCH64__ */
   asm volatile("isb");

#ifdef DEBUG_PMU
#ifdef __AARCH64__
   asm volatile("MRS %0, PMCR_EL0" : "=r"(reg64_val) : : );
   printf("<D> PMCR_EL0 = 0x%016llx\n", reg64_val);
#else
   asm volatile("MRC p15, 0, %0, c9, c12, 0" : "=r"(reg32_val) : : );
   printf("<D> PMCR = 0x%08x\n", reg32_val);
#endif /* __AARCH64__ */
#endif /* DEBUG_PMU */

   /* configure the 64-bit cycle counter : */
#ifdef __AARCH64__
   asm volatile("MRS %0, PMCR_EL0" : "=r"(reg64_val) : : );
#else
   asm volatile("MRC p15, 0, %0, c9, c12, 0" : "=r"(reg32_val) : : );
#endif /* __AARCH64__ */
   /* - divide 64-bit cycle counter by 64 if requested */
   if (1 == count_div_by_64)
   {
   /*   by setting bit 3 "D" "clock divider" */
#ifdef __AARCH64__
        reg64_val |= (1<<3);
#else
        reg32_val |= (1<<3);
#endif /* __AARCH64__ */
   /*   and then disable long cycle count (set overflow on 32-bit counting) */
   /*   by clearing bit 6 "LC" "Long cycle count enable" */
   /*   BECAUSE THIS BIT SETTING KILLS BIT 3 EFFECT : PMU AARCH64 BUG !!? */
#ifdef __AARCH64__
        reg64_val &= ~(1<<6);
#else
        reg32_val &= ~(1<<6);
#endif /* __AARCH64__ */
   /*   if not requested, */
   }
   else
   {
   /*   by clearing bit 3 "D" "clock divider" */
#ifdef __AARCH64__
        reg64_val &= ~(1<<3);
#else
        reg32_val &= ~(1<<3);
#endif /* __AARCH64__ */
   /*   and then enable long cycle count (set overflow on 64-bit counting) */
   /*   by setting bit 6 "LC" "Long cycle count enable" */
#ifdef __AARCH64__
        reg64_val |= (1<<6);
#else
        reg32_val |= (1<<6);
#endif /* __AARCH64__ */
   }
#ifdef __AARCH64__
   asm volatile("MSR PMCR_EL0, %0" : : "r"(reg64_val) : );
#else
   asm volatile("MCR p15, 0, %0, c9, c12, 0" : : "r"(reg32_val) : );
#endif /* __AARCH64__ */
   asm volatile("isb");

#ifdef DEBUG_PMU
#ifdef __AARCH64__
   asm volatile("MRS %0, PMCR_EL0" : "=r"(reg64_val) : : );
   printf("<D> PMCR_EL0 = 0x%016llx\n", reg64_val);
#else
   asm volatile("MRC p15, 0, %0, c9, c12, 0" : "=r"(reg32_val) : : );
   printf("<D> PMCR = 0x%08x\n", reg32_val);
#endif /* __AARCH64__ */
#endif /* DEBUG_PMU */

   /* configure the 64-bit cycle counter : */
   /* - enable all counters (cycle counter included) */
   /*   by setting bit 0 "E" "Enable" */
#ifdef __AARCH64__
   asm volatile("MRS %0, PMCR_EL0" : "=r"(reg64_val) : : );
   reg64_val |= (1<<0);
   asm volatile("MSR PMCR_EL0, %0" : : "r"(reg64_val) : );
#else
   asm volatile("MRC p15, 0, %0, c9, c12, 0" : "=r"(reg32_val) : : );
   reg32_val |= (1<<0);
   asm volatile("MCR p15, 0, %0, c9, c12, 0" : : "r"(reg32_val) : );
#endif /* __AARCH64__ */
   asm volatile("isb");

#ifdef DEBUG_PMU
#ifdef __AARCH64__
   asm volatile("MRS %0, PMCR_EL0" : "=r"(reg64_val) : : );
   printf("<D> PMCR_EL0 = 0x%016llx\n", reg64_val);
#else
   asm volatile("MRC p15, 0, %0, c9, c12, 0" : "=r"(reg32_val) : : );
   printf("<D> PMCR = 0x%08x\n", reg32_val);
#endif /* __AARCH64__ */
#endif /* DEBUG_PMU */

