zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/system_stm32mp2xx_a35_utils.c
   /* start the cycle counter by setting bit 31 "C" of : */
#ifdef __AARCH64__
   /* - PMCNTENSET_EL0 register in Aarch64 (see #D7.4.6 in [ARM DDI 0487B.a]) */
   asm volatile("MRS %0, PMCNTENSET_EL0" : "=r"(reg64_val) : : );
   reg64_val |= (1<<31);
   asm volatile("MSR PMCNTENSET_EL0, %0" : : "r"(reg64_val) : );
#else
   /* - PMCNTENSET register in Aarch32 (see #G6.4.9 in [ARM DDI 0487B.a]) */
   asm volatile("MRC p15, 0, %0, c9, c12, 1" : "=r"(reg32_val) : : );
   reg32_val |= (1<<31);
   asm volatile("MCR p15, 0, %0, c9, c12, 1" : : "r"(reg32_val) : );
#endif /* __AARCH64__ */
   asm volatile("isb");

   return;
}

////////////////////////////////////////////////////////////////////////////////
void a35_pmu_cycle_count_stop()
{
#ifdef __AARCH64__
   uint64_t reg64_val;
#else
   uint32_t reg32_val;
#endif /* __AARCH64__ */

   /* complete all data transactions */
   asm volatile("dsb sy");
   /* disable all counters */
#ifdef __AARCH64__
   asm volatile("MRS %0, PMCR_EL0" : "=r"(reg64_val) : : );
   reg64_val &= ~(1<<0);
   asm volatile("MSR PMCR_EL0, %0" : : "r"(reg64_val) : );
#else
   asm volatile("MRC p15, 0, %0, c9, c12, 0" : "=r"(reg32_val) : : );
   reg32_val &= ~(1<<0);
   asm volatile("MCR p15, 0, %0, c9, c12, 0" : : "r"(reg32_val) : );
#endif /* __AARCH64__ */
   return;
}

////////////////////////////////////////////////////////////////////////////////
uint64_t a35_pmu_cycle_count_read()
{
   uint64_t reg_val;

   /* ensure the execution flow is completed */
   asm volatile("isb");
   /* ensure the data accesses are completed */
   asm volatile("dsb sy");
   /* get cycle counter value (width = 64) */
#ifdef __AARCH64__
   /* . in Aarch64, from register PMCCNTR_EL0 */
   /*   (see #D7.4.2 in [ARM DDI 0487B.a])    */
   asm volatile("MRS %0, PMCCNTR_EL0" : "=r"(reg_val) : : );
#else
   /* . in Aarch32, from register PMCCNTR  */
   /*   (see #G6.4.2 in [ARM DDI 0487B.a]) */
   uint32_t reg32_val;
   asm volatile("MRC p15, 0, %0, c9, c13, 0" : "=r"(reg32_val) : : );
   reg_val = (uint64_t)reg32_val;
#endif /* __AARCH64__ */

   return reg_val;
}

////////////////////////////////////////////////////////////////////////////////
long a35_get_time_in_second( void )
{
   return (long)(a35_pmu_cycle_count_read()/(uint64_t)gl_cpu_freq_in_Hz);
}


#if 0 /* TO BE IMPLEMENTED IN Aarch32 & Aarch64 */
////////////////////////////////////////////////////////////////////////////////
void a35_pmu_program_cycle_count_overflow_interrupt( bool_t a_force_it_flag )
{
#ifdef DEBUG_PMU
   uint32_t reg_val;
#endif
   /* complete all data transactions */
   asm volatile("dsb sy");

   /* configure the 64-bit cycle counter (register PMCR_EL0) : */
   asm volatile("MRS x0, PMCR_EL0");
   /* - reset it by setting bit 2 "C" "clock counter reset" */
   asm volatile("ORR x0,x0, #1<<2");
   asm volatile("MSR PMCR_EL0, x0");
   asm volatile("isb");

#ifdef DEBUG_PMU
   asm volatile("MRS %0, PMCR_EL0" : "=r"(reg_val) : /* no input regs */ : /* no clobbered regs */);
   printf("<D> PMCR_EL0 = 0x%08x\n", reg_val);
#endif

   /* configure the 64-bit cycle counter (register PMCR_EL0) : */
   asm volatile("MRS x0, PMCR_EL0");
   /* - DO NOT divide 64-bit cycle counter by 64 if requested */
   /*   by clearing bit 3 "D" "clock divider" */
        asm volatile("BIC x0,x0, #1<<3");
   /* - Disable long cycle count (set overflow on 32-bit counting) */
   /*   by clearing bit 6 "LC" "Long cycle count enable" */
        asm volatile("BIC x0,x0, #1<<6");

   asm volatile("MSR PMCR_EL0, x0");
   asm volatile("isb");

#ifdef DEBUG_PMU
   asm volatile("MRS %0, PMCR_EL0" : "=r"(reg_val) : /* no input regs */ : /* no clobbered regs */);
   printf("<D> PMCR_EL0 = 0x%08x\n", reg_val);
#endif

   /* set the Performance Monitors Cycle Counter for limiting delay           */
   /* before PUIRQn emission : from about 6 seconds (cycle clock at 690MHz),  */
   /* when starting from 0x0 to about 1 second when starting from 0xD000_0000 */
   asm volatile("LDR x0, =0xD0000000");
   asm volatile("MSR PMCCNTR_EL0, x0");
   asm volatile("isb");

   /* configure the 64-bit cycle counter (register PMCR_EL0) : */
   asm volatile("MRS x0, PMCR_EL0");
   /* - enable all counters (cycle counter included) */
   /*   by setting bit 0 "E" "Enable" */
   asm volatile("ORR x0,x0, #1");
   asm volatile("MSR PMCR_EL0, x0");
   asm volatile("isb");

#ifdef DEBUG_PMU
   asm volatile("MRS %0, PMCR_EL0" : "=r"(reg_val) : /* no input regs */ : /* no clobbered regs */);
   printf("<D> PMCR_EL0 = 0x%08x\n", reg_val);
#endif

   /* clear Performance Monitors Overflow Flag Status */
   asm volatile("LDR x0, =0x80000000");
   asm volatile("MSR PMOVSCLR_EL0, x0");
   asm volatile("isb");

   /* enable PMCCNTR_EL0 overflow interrupt request */
   asm volatile("MRS x0, PMINTENSET_EL1");
   asm volatile("ORR x0,x0, #1<<31");
   asm volatile("MSR PMINTENSET_EL1, x0");
   asm volatile("isb");

   if (TRUE == a_force_it_flag)
   {
      /* set Performance Monitors Overflow Flag Status */
      asm volatile("LDR x0, =0x80000000");
      asm volatile("MSR PMOVSSET_EL0, x0");
      asm volatile("isb");
   }
   else
   {
      /* start the cycle counter */
      asm volatile("MRS x0, PMCNTENSET_EL0");
      asm volatile("ORR x0,x0, #1<<31");
      asm volatile("MSR PMCNTENSET_EL0, x0");
      asm volatile("isb");
   }
   return;
}

////////////////////////////////////////////////////////////////////////////////
void a35_pmu_stop_pmu_interrupt( void )
{
   /* Stop PMUIRQn : */
   /* - by setting Performance Monitors Overflow Flag Status Clear */
   /*   see [ARM DDI 0487B.a] #D7.4.12 */
   asm volatile("LDR x0, =0x80000000");
   asm volatile("MSR PMOVSCLR_EL0, x0");
   /* - by setting Performance Monitors Interrupt Enable Clear */
   /*   see [ARM DDI 0487B.a] #D7.4.10 */
   asm volatile("LDR x0, =0x80000000");
   asm volatile("MSR PMINTENCLR_EL1, x0");
   /* - by stopping/disabling cycle counter */
   asm volatile("MRS x0, PMCR_EL0");
   asm volatile("BIC x0,x0, #1");
   asm volatile("MSR PMCR_EL0, x0");

   return;
}

////////////////////////////////////////////////////////////////////////////////
void a35_pmu_output_registers( void )
{
   uint32_t reg_val32, i, reg2_val32;

