zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/system_stm32mp2xx_a35_utils.c
   /* Read Performance Monitors Common Event Identification Register 0 */
   /* (see #C10.7 [A35_TRM]) */
   asm volatile("MRS %0, PMCEID0_EL0" : "=r"(reg_val32) : /* no input regs */ : /* no clobbered regs */);
   printf("<PMU> PMCEID0_EL0    = 0x%08x\n", reg_val32);
   /* Read Performance Monitors Control Register           */
   /* (see #D7.4.7 [ARM DDI 0487B.a] and #C10.6 [A35_TRM]) */
   asm volatile("MRS %0, PMCR_EL0" : "=r"(reg_val32) : /* no input regs */ : /* no clobbered regs */);
   printf("<PMU> PMCR_EL0       = 0x%08x\n", reg_val32);

   /* Read Performance Monitors Count Enable Set register */
   /* (see #D7.4.6 [ARM DDI 0487B.a])                     */
   asm volatile("MRS %0, PMCNTENSET_EL0" : "=r"(reg_val32) : /* no input regs */ : /* no clobbered regs */);
   printf("<PMU> PMCNTENSET_EL0 = 0x%08x\n", reg_val32);
   /* Read Performance Monitors Count Enable Clear register */
   /* (see #D7.4.5 [ARM DDI 0487B.a])                       */
   asm volatile("MRS %0, PMCNTENCLR_EL0" : "=r"(reg_val32) : /* no input regs */ : /* no clobbered regs */);
   printf("<PMU> PMCNTENCLR_EL0 = 0x%08x\n", reg_val32);

   /* Read all event counters with their corresponding types */
   for (i = 0; i < PMU_EVENT_NB_COUNTER; i++)
   {
      asm volatile("MSR PMSELR_EL0,%0"::"r" (i));
      asm volatile("ISB");
      asm volatile("MRS %0, PMXEVCNTR_EL0" : "=r"(reg_val32) : /* no input regs */ : /* no clobbered regs */);
      asm volatile("MRS %0, PMXEVTYPER_EL0" : "=r"(reg2_val32) : /* no input regs */ : /* no clobbered regs */);
      printf("<PMU> PMXEVCNTR%d_EL0 (type 0x%02X) = 0x%08x\n",
             i, reg2_val32, reg_val32);
   }
   return;
}

////////////////////////////////////////////////////////////////////////////////
void a35_pmu_enable_counters( void )
{
   /* Enable all counters (events and cycle) */
   /* - by reading Performance Monitors Control Register     */
   /*   (see #D7.4.7 [ARM DDI 0487B.a] and #C10.6 [A35_TRM]) */
   asm volatile("MRS x0, PMCR_EL0");
   /* - by setting bit 0 "E" "Enable" */
   asm volatile("ORR x0,x0, #1");
   /* - by writing back Performance Monitors Control Register */
   asm volatile("MSR PMCR_EL0, x0");
   asm volatile("ISB");
   return;
}

////////////////////////////////////////////////////////////////////////////////
void a35_pmu_reset_event_counters( void )
{
   /* Reset all event counters */
   /* - by reading Performance Monitors Control Register     */
   /*   (see #D7.4.7 [ARM DDI 0487B.a] and #C10.6 [A35_TRM]) */
   asm volatile("MRS x0, PMCR_EL0");
   /* - by setting bit 1 "P" "Event counter reset" */
   asm volatile("ORR x0,x0, #2");
   /* - by writing back Performance Monitors Control Register */
   asm volatile("MSR PMCR_EL0, x0");
   asm volatile("ISB");
   return;
}

////////////////////////////////////////////////////////////////////////////////
void a35_pmu_configure_event( uint32_t a_counter_idx,
                              uint32_t a_event_type_val )
{
   /* Configure event type to selected value according to selected counter index */
   if (a_counter_idx <= PMU_EVENT_MAX_COUNTER)
   {
   /* - by setting Performance Monitors Event Counter Selection Register */
   /*   see #D7.4.14 [ARM DDI 0487B.a] */
   /*   to selected counter index */
      asm volatile("MSR PMSELR_EL0,%0"::"r" (a_counter_idx));
   /* - by synchronizing context (with an Instruction Synchronization Barrier) */
      asm volatile("ISB");
   /* - by setting Performance Monitors Selected Event Type Register */
   /*   see #D7.4.18 [ARM DDI 0487B.a] */
   /*   to selected event type value */
      asm volatile("MSR PMXEVTYPER_EL0,%0"::"r" (a_event_type_val));
   }
   else
   {
      printf("<E> a35_pmu_configure_event - ERROR : invalid event counter index %d\n",
             a_counter_idx);
   }
   return;
}

////////////////////////////////////////////////////////////////////////////////
void a35_pmu_start_event_counter( uint32_t a_counter_idx )
{
   uint32_t reg_val32;

   /* Start event counter according to selected counter index */
   if (a_counter_idx <= PMU_EVENT_MAX_COUNTER)
   {
   /* - by setting Performance Monitors Count Enable Set register */
   /*   see #D7.4.6 [ARM DDI 0487B.a] */
   /*   bit <n> for counter index <n> */
      reg_val32 = 1 << a_counter_idx;
      asm volatile("MSR PMCNTENSET_EL0,%0"::"r" (reg_val32));
   }
   else
   {
      printf("<E> a35_pmu_start_event_counter - ERROR : invalid event counter index %d\n",
             a_counter_idx);
   }
   return;
}

////////////////////////////////////////////////////////////////////////////////
void a35_pmu_read_event_counter( uint32_t a_counter_idx )
{
   uint32_t reg_val32, reg2_val32;

   /* Read event count and event type according to selected counter index */
   if (a_counter_idx <= PMU_EVENT_MAX_COUNTER)
   {
      asm volatile("MSR PMSELR_EL0,%0"::"r" (a_counter_idx));
      asm volatile("ISB");
      asm volatile("MRS %0, PMXEVCNTR_EL0" : "=r"(reg_val32) : /* no input regs */ : /* no clobbered regs */);
      asm volatile("MRS %0, PMXEVTYPER_EL0" : "=r"(reg2_val32) : /* no input regs */ : /* no clobbered regs */);
      printf("<PMU> PMXEVCNTR%d_EL0 (type 0x%02X) = 0x%08x\n",
             a_counter_idx, reg2_val32, reg_val32);
   }
   else
   {
      printf("<E> a35_pmu_read_event_counter - ERROR : invalid event counter index %d\n",
             a_counter_idx);
   }
   return;
}

////////////////////////////////////////////////////////////////////////////////
void a35_pmu_stop_event_counter( uint32_t a_counter_idx )
{
   uint32_t reg_val32;

   /* Stop event counter according to selected counter index */
   if (a_counter_idx <= PMU_EVENT_MAX_COUNTER)
   {
   /* - by setting Performance Monitors Count Enable Clear register */
   /*   see #D7.4.5 [ARM DDI 0487B.a] */
   /*   bit <n> for counter index <n> */
      reg_val32 = 1 << a_counter_idx;
      asm volatile("MSR PMCNTENCLR_EL0,%0"::"r" (reg_val32));
   }
   else
   {
      printf("<E> a35_pmu_stop_event_counter - ERROR : invalid event counter index %d\n",
             a_counter_idx);
   }
   return;
}

////////////////////////////////////////////////////////////////////////////////
void a35_pmu_start_all_event_counters( void )
{
   uint32_t reg_val32;
   /* Stop all (six) event counters */
   /* - by setting Performance Monitors Count Enable Set register */
   /*   see #D7.4.6 [ARM DDI 0487B.a] */
   /*   to value 0x3F (bit <n> for counter index <n>) */
   reg_val32 = 0x3FUL;
   asm volatile("MSR PMCNTENSET_EL0,%0"::"r" (reg_val32));
   return;
}

////////////////////////////////////////////////////////////////////////////////
void a35_pmu_stop_all_event_counters( void )
{
   uint32_t reg_val32;
   /* Stop all (six) event counters */
   /* - by setting Performance Monitors Count Enable Clear register */
   /*   see #D7.4.5 [ARM DDI 0487B.a] */
   /*   to value 0x3F (bit <n> for counter index <n>) */
   reg_val32 = 0x3FUL;
   asm volatile("MSR PMCNTENCLR_EL0,%0"::"r" (reg_val32));
   return;
}

////////////////////////////////////////////////////////////////////////////////
void  a35_pmu_output_external_registers( uint32_t a_core_idx )
{
   uint32_t pmu_reg_base_addr, reg32_addr, i, reg32_addr2;
   bool_t output_flag = TRUE;

