zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/system_stm32mp2xx_a35_utils.c
   /* set PMU external registers base address according to selected core index */
   switch(a_core_idx)
   {
      case 0 :
	     pmu_reg_base_addr = A35MP4_PMU_CPU0_BaseAddr;
	     break;
      case 1 :
	     pmu_reg_base_addr = A35MP4_PMU_CPU1_BaseAddr;
	     break;
      default :
	     output_flag = FALSE;
		 printf("<E> a35_pmu_output_external_registers - ERROR : invalid core index %d\n",
                a_core_idx);
	     break;
   }
   if (TRUE == output_flag)
   {
   /* Read Performance Monitors Common Event Identification Register 0 : see #I3.4.4 [ARM DDI 0487B.a] */
      printf("<PMU> CPU%d-PMUCEID0       = 0x%08x\n",
	         a_core_idx, REG_READ32(pmu_reg_base_addr+PMCEID0_offset) );
   /* Read Performance Monitors Control Register : see #I3.4.17 [ARM DDI 0487B.a] */
      printf("<PMU> CPU%d-PMCR_EL0       = 0x%08x\n",
	         a_core_idx, REG_READ32(pmu_reg_base_addr+PMCR_EL0_offset) );
   /* Read Performance Monitors Count Enable Set register : see #I3.4.16 [ARM DDI 0487B.a] */
      printf("<PMU> CPU%d-PMCNTENSET_EL0 = 0x%08x\n",
	         a_core_idx, REG_READ32(pmu_reg_base_addr+PMCNTENSET_EL0_offset) );
   /* Read Performance Monitors Count Enable Clear register : see #I3.4.15 [ARM DDI 0487B.a] */
      printf("<PMU> CPU%d-PMCNTENCLR_EL0 = 0x%08x\n",
	         a_core_idx, REG_READ32(pmu_reg_base_addr+PMCNTENCLR_EL0_offset) );

   /* Read all event counters with their corresponding types */
      for (i = 0; i < PMU_EVENT_NB_COUNTER; i++)
      {
   /* Read Performance Monitors Event Count Registers, n = 0 - 30 : see #I3.4.23 [ARM DDI 0487B.a] */
         reg32_addr = pmu_reg_base_addr + PMEVCNTR0_EL0_offset + 0x8*i;
   /* Read Performance Monitors Event Type Registers,  n = 0 - 30 : see #I3.4.24 [ARM DDI 0487B.a] */
         reg32_addr2 = pmu_reg_base_addr + PMEVTYPER0_EL0_offset + 0x4*i;
         printf("<PMU> CPU%d-PMXEVCNTR%d_EL0 (type 0x%02X) = 0x%08x\n",
                a_core_idx, i, REG_READ32((uint64_t)reg32_addr2),
				REG_READ32((uint64_t)reg32_addr) );
      }
   }
   return;
}
#endif

/***********************************************************************/
/* Function to measure CPU frequency in respect to Timestamp generator */
/* at 32 or 64MHz by using STGEN and Cycle counters                    */
/* - function a35_measure_cpu_freq() :                                 */
uint32_t a35_measure_cpu_freq( void )
{
   volatile unsigned int reg_val;
   volatile uint32_t cycle_count0, cycle_count1, cycle_count_duration;

/*   . getting cycle counter at "STGEN counter ref value"    */
   reg_val = STGENR->CNTCVL;
   cycle_count0 = a35_pmu_cycle_count_read();
/*   . set "STGEN counter end value" = ref + 1000 ms         */
   reg_val += STGENC->CNTFID0;
/*   . waiting until STGEN reaches "STGEN counter end value" */
   while (STGENR->CNTCVL < reg_val) {};
/*   . stopping cycle counter                                */
   cycle_count1 = a35_pmu_cycle_count_read();
   a35_pmu_cycle_count_stop();
/*   . computed frequency is PMU counted value during 1000ms */
   cycle_count_duration = cycle_count1 - cycle_count0;
/*   . set value to global variable */
   gl_cpu_freq_in_Hz = cycle_count_duration;

#ifdef DEBUG_FREQ
   printf("<D> Measure_CPU_Frequency : t0 = %d - t1 = %d --> cycle_count_duration = %d\n",
          cycle_count0, cycle_count1, cycle_count_duration);
#endif
   return cycle_count_duration;
}

/* - function a35_get_cpu_freq_in_Hz() : */
uint32_t a35_get_cpu_freq_in_Hz( void )
{
   return gl_cpu_freq_in_Hz;
}
